Sprawozdanie 2: Łączenie z bazą danych i instrukcja SELECT
<br>
Autor: Michał Badura, numer albumu: 407049

In [1]:
import psycopg2 as pg
import pandas as pd

connection = pg.connect(host='pgsql-196447.vipserv.org', port=5432, dbname='wbauer_adb', user='wbauer_adb', password='adb2020')

category = pd.read_sql("select * "
                       "from category",con=connection)
print(category)

    category_id         name         last_update
0             1       Action 2006-02-15 09:46:27
1             2    Animation 2006-02-15 09:46:27
2             3     Children 2006-02-15 09:46:27
3             4     Classics 2006-02-15 09:46:27
4             5       Comedy 2006-02-15 09:46:27
5             6  Documentary 2006-02-15 09:46:27
6             7        Drama 2006-02-15 09:46:27
7             8       Family 2006-02-15 09:46:27
8             9      Foreign 2006-02-15 09:46:27
9            10        Games 2006-02-15 09:46:27
10           11       Horror 2006-02-15 09:46:27
11           12        Music 2006-02-15 09:46:27
12           13          New 2006-02-15 09:46:27
13           14       Sci-Fi 2006-02-15 09:46:27
14           15       Sports 2006-02-15 09:46:27
15           16       Travel 2006-02-15 09:46:27

Ćwiczenie 1:

In [2]:
number = pd.read_sql("select count(name) "
                     "from category",con=connection)

print("Liczba kategorii filmów wynosi: \n {}".format(number))

Liczba kategorii filmów wynosi:
    count
0     16

Ćwiczenie 2:

In [3]:

alphabetical = pd.read_sql("select name "
                           "from category "
                           "order by name ASC",con=connection)
print(alphabetical)

           name
0        Action
1     Animation
2      Children
3      Classics
4        Comedy
5   Documentary
6         Drama
7        Family
8       Foreign
9         Games
10       Horror
11        Music
12          New
13       Sci-Fi
14       Sports
15       Travel

Ćwiczenie 3:

In [4]:
oldest = pd.read_sql("select title "
                     "from film "
                     "order by release_year ASC "
                     "limit 1", con=connection)

youngest = pd.read_sql("select title "
                       "from film "
                       "order by release_year DESC "
                       "limit 1", con=connection)
print("Najstarszy film: {} \n".format(oldest))
print("Najmłodszy film: {} \n".format(youngest))

Najstarszy film:              title
0  Chamber Italian

Najmłodszy film:              title
0  Chamber Italian

Ćwiczenie 4:

In [5]:
rental_between = pd.read_sql("select count(rental_date) "
                             "from rental "
                             "where rental_date "
                             "between '2005-07-01T00:00:00.00' and '2005-08-01T00:00:00.00'", con=connection)
print(rental_between)

   count
0   6709

Ćwiczenie 5:

In [6]:
rental_between2 = pd.read_sql("select count(rental_date) "
                             "from rental "
                             "where rental_date "
                             "between '2010-01-01T00:00:00.00' and '2011-02-01T00:00:00.00'", con=connection)
print(rental_between2)

   count
0      0

Ćwiczenie 6:

In [7]:
biggest_payment = pd.read_sql("select amount "
                              "from payment "
                              "order by amount DESC "
                              "limit 1", con=connection)
print(biggest_payment)

   amount
0   11.99

Ćwiczenie 7:

In [8]:
clients = pd.read_sql("select customer.customer_id, customer.store_id, customer.first_name, customer.last_name "
                      "from customer "
                      "left join address "
                      "on customer.address_id = address.address_id "
                      "left join city "
                      "on address.city_id = city.city_id "
                      "left join country "
                      "on city.country_id = country.country_id "
                      "where country in ('Poland', 'Nigeria', 'Bangladesh')", con=connection)
print(clients)

    customer_id  store_id first_name  last_name
0           284         1      Sonia    Gregory
1           318         1      Brian      Wyman
2           572         1     Sidney   Burleson
3           409         2     Rodney    Moeller
4           332         1    Stephen     Qualls
5           286         1      Velma      Lucas
6            80         1    Marilyn       Ross
7           198         2      Elsie     Kelley
8           103         1     Gladys   Hamilton
9           329         2      Frank   Waggoner
10          128         1   Marjorie     Tucker
11           18         2      Carol     Garcia
12          270         1       Leah     Curtis
13          501         1      Ruben      Geary
14          277         2       Olga    Jimenez
15          156         1     Bertha   Ferguson
16          280         2     Tracey    Barrett
17          250         2         Jo     Fowler
18          571         2    Johnnie   Chisholm
19          562         1    Wallace      Slone
20           21         1   Michelle      Clark
21          380         1    Russell    Brinson
22          558         1     Jimmie  Eggleston
23          232         2  Constance       Reid

Ćwiczenie 8:

In [9]:
origin = pd.read_sql("select staff.staff_id, staff.first_name, staff.last_name, country.country "
                     "from staff "
                     "left join address "
                     "on staff.address_id = address.address_id "
                     "left join city "
                     "on address.city_id = city.city_id "
                     "left join country "
                     "on city.country_id = country.country_id", con=connection)
print(origin)

   staff_id first_name last_name    country
0         1       Mike   Hillyer     Canada
1         2        Jon  Stephens  Australia

Ćwiczenie 9:

In [10]:
num = pd.read_sql("select count(staff.staff_id) "
                  "from staff "
                  "left join address "
                  "on staff.address_id = address.address_id "
                  "left join city "
                  "on address.city_id = city.city_id "
                  "left join country "
                  "on city.country_id = country.country_id "
                  "where country in ('Argentina', 'Spain')", con=connection)
print("Liczba pracowników w Hiszpanii i Argentynie: \n {}".format(num))

Liczba pracowników w Hiszpanii i Argentynie:
    count
0      0

Ćwiczenie 10:

In [11]:
rented = pd.read_sql("select distinct category.name "
                     "from category "
                     "inner join film_category "
                     "on category.category_id = film_category.category_id "
                     "inner join film "
                     "on film_category.film_id = film.film_id "
                     "inner join inventory "
                     "on film.film_id = inventory.film_id "
                     "inner join rental "
                     "on inventory.inventory_id = rental.inventory_id", con=connection)
print(rented)

           name
0        Sports
1      Classics
2           New
3        Family
4        Comedy
5     Animation
6        Travel
7         Music
8         Drama
9        Horror
10       Sci-Fi
11        Games
12  Documentary
13      Foreign
14       Action
15     Children

Ćwiczenie 11:

In [12]:
rented_us = pd.read_sql("select distinct category.name "
                     "from category "
                     "inner join film_category "
                     "on category.category_id = film_category.category_id "
                     "inner join film "
                     "on film_category.film_id = film.film_id "
                     "inner join inventory "
                     "on film.film_id = inventory.film_id "
                     "inner join rental "
                     "on inventory.inventory_id = rental.inventory_id "
                     "inner join staff "
                     "on rental.staff_id = staff.staff_id "
                     "inner join store "
                     "on staff.store_id = store.store_id "
                     "inner join address "
                     "on store.address_id = address.address_id "
                     "inner join city "
                     "on address.city_id = city.city_id "
                     "inner join country "
                     "on city.country_id = country.country_id "
                     "where country.country in ('United States')", con=connection)
print(rented_us)
print("Nie wypożyczono żadnego filmu")

Empty DataFrame
Columns: [name]
Index: []
Nie wypożyczono żadnego filmu

Ćwiczenie 12:

In [13]:
titles = pd.read_sql("select film.title "
                     "from film "
                     "left join film_actor "
                     "on film.film_id = film_actor.film_id "
                     "left join actor "
                     "on film_actor.actor_id = actor.actor_id "
                     "where (first_name = 'Olympia' and last_name = 'Pfeiffer') or (first_name = 'Julia' and last_name = 'Zellweger') or (first_name = 'Ellen' and last_name = 'Presley')", con=connection)
print(titles)

                title
0     Bilko Anonymous
1   Caribbean Liberty
2    Casper Dragonfly
3    Empire Malkovich
4       Floats Garden
..                ...
64       Outlaw Hanky
65    Panky Submarine
66   Rider Caddyshack
67          Won Dares
68      Wyoming Storm

[69 rows x 1 columns]